tap "1password/tap"
tap "homebrew/cask"
tap "cjbassi/gotop"
tap "colindean/fonts-nonfree"
tap "cube2222/octosql"
tap "cue-lang/tap"
tap "dagger/tap"
tap "FelixKratz/formulae"
tap "github/gh"
tap "goreleaser/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "lucassabreu/tap"
tap "microsoft/mssql-release"
tap "minio/stable"
tap "osx-cross/avr", "git@github.com:osx-cross/homebrew-avr.git"
tap "px4/px4"

brew "act"
brew "asciidoctor"
brew "awscli"
brew "bash"
brew "bat"
brew "blueutil"
brew "cjbassi/gotop/gotop"
brew "cmake"
brew "colima"
brew "coreutils"
brew "cube2222/octosql/octosql"
brew "cue-lang/tap/cue"
brew "curl"
brew "dagger/tap/dagger"
brew "docker"
brew "fd"
brew "ffmpeg"
brew "fish", args: ["HEAD"]
brew "fontforge"
brew "freetds"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "glib"
brew "gnutls"
brew "go"
brew "guile"
brew "heroku/brew/heroku"
brew "jq"
brew "k6"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "krb5"
brew "libgit2"
brew "libssh2"
brew "lima"
brew "lsd"
brew "lua"
brew "luajit", args: ["HEAD"]
brew "luarocks"
brew "lucassabreu/tap/clockify-cli"
brew "mpc"
brew "mpd"
brew "ncmpcpp"
brew "neovim", args: ["HEAD"]
brew "node"
brew "python@3.9"
brew "ranger"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "sketchybar"
brew "slides"
brew "starship"
brew "textql"
brew "tree-sitter"
brew "xsv"
brew "youtube-dl"
brew "yq"
brew "zoxide"

cask "1password-cli"
cask "alfred"
cask "brave-browser"
cask "disk-inventory-x"
# cask "dropbox"
cask "istat-menus"
cask "karabiner-elements"
cask "kitty"
cask "mpv"
cask "notunes"
cask "recordit"
cask "rocket"
# cask "slack"
cask "snowflake-snowsql"
cask "visual-studio-code"

mas "Balance Lock", id: 1019371109
mas "Key Codes", id: 414568915
mas "Pixelmator", id: 407963104

# giphy : https://tenor.com/mac
# cleanshot: https://cleanshot.com/
