cask_args appdir: '/Applications'

#
# Taps
#
tap 'caskroom/cask'
tap 'crisidev/homebrew-chunkwm'

#
# Plugins
#
brew 'mas'

#
# Brew Apps
brew 'autojump'
brew 'bash'
brew 'chunkwm'
brew 'cscope'
brew 'ctags'
brew 'diff-so-fancy'
brew 'exa'
brew 'fzf'
brew 'git'
brew 'gpg'
brew 'heroku'
brew 'hub'
brew 'mpc'
brew 'mpd'
brew 'ncmpcpp'
brew 'neofetch'
brew 'neovim', args: ['--with-override-system-vim']
brew 'ranger'
brew 'readline'
brew 'ripgrep'
brew 'ruby'
brew 'qes'
brew 'shellcheck'
# brew install koekeishiya/formulae/skhd
# brew 'vim', args: ['--with-override-system-vim']

#
# Cask Apps
#
cask 'alfred'
cask 'bartender'
cask 'disk-inventory-x'
cask 'dropbox'
cask 'flash-npapi'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'istat-menus'
cask 'iterm2'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'karabiner-elements'
cask 'recordit'
cask 'rocket'
cask 'tunnelbear'
cask 'vanilla'
cask 'visual-studio-code'
cask 'vlc'

#
# Mac App Store Apps
#
mas '1password',     id: 443987910
mas 'giphy capture', id: 668208984
mas 'Monosnap',      id: 540348655
mas 'pipifier',      id: 1160374471
mas 'pixelmator',    id: 407963104
mas 'slack',         id: 803453959
#
# Apps not avaialable on brew/cask/mas
#
# marked2 - http://marked2app.com

#
# Safari Extensions
#
# omnikey         - http://marioestrada.github.io/safari-omnikey/
# json-formatter  - https://github.com/rfletcher/safari-json-formatter
# vimmy           - https://github.com/gggritso/Vimmy.safariextension

#
# Frameworks/Extensios/Other
#
# bash-it         - https://github.com/Bash-it/bash-it
# powerline fonts - https://github.com/powerline/fonts
# vscode-onedark  - https://github.com/azemoh/vscode-onedark
# vscode-vim      - https://github.com/VSCodeVim/Vim
# circleci        - https://circleci.com/docs/2.0/local-jobs/#installing-the-cli-locally
