tap "1password/tap"
tap "homebrew/cask"
tap "cue-lang/tap"
tap "dagger/tap"
tap "FelixKratz/formulae"
tap "goreleaser/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "minio/stable"
tap "osx-cross/avr", "git@github.com:osx-cross/homebrew-avr.git"
tap "px4/px4"

brew "act"
brew "awscli"
brew "blueutil"
brew "chezmoi"
brew "colima"
brew "coreutils"
brew "cue-lang/tap/cue"
brew "dagger/tap/dagger"
brew "docker"
brew "ffmpeg"
brew "fish", args: ["HEAD"]
brew "fontforge"
brew "freetds"
brew "fzf"
brew "gnutls"
brew "guile"
brew "k6"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "lsd"
brew "luajit", args: ["HEAD"]
brew "luarocks"
brew "mpc"
brew "mpd"
brew "ncmpcpp"
brew "ranger"
brew "sketchybar"
brew "slides"
brew "starship"
brew "tree-sitter"
brew "xsv"
brew "zoxide"

cask "1password-cli"
cask "disk-inventory-x"
cask "istat-menus"
cask "karabiner-elements"
cask "kitty"
cask "mpv"
cask "notunes"
cask "rocket"
cask "visual-studio-code"

mas "Balance Lock", id: 1019371109
mas "Key Codes", id: 414568915
mas "Pixelmator", id: 407963104

# giphy : https://tenor.com/mac
# cleanshot: https://cleanshot.com/
